#!/usr/bin/python
# -*- coding: latin-1 -*-
from pymongo import MongoClient, DESCENDING
from bson.code import Code


db = MongoClient('mongodb://localhost:27017').sahamyab

map = Code("function () {"
           "  this.content.split(/[\s\u200c]/).forEach(function(word) {"
           "     emit(word, 1);"
           "  });"
           "}")
reduce = Code("function (key, values) {"
              "  var total = 0;"
              "  for (var i = 0; i < values.length; i++) {"
              "    total += values[i];"
              "  }"
              "  return total;"
              "}")


result = db.tweets.map_reduce(map, reduce, "myresults")
for doc in result.find().sort([("value", DESCENDING)]).limit(30):
    print(doc)

# ["!","#","(",")","*","","","-",".","/",":","[","]","«","»","،","؛","؟","آباد","آخ","آخر","آخرها","آخه","آدمهاست","آرام","آرام آرام","آره","آری","آزادانه","آسان","آسیب پذیرند","آشنایند","آشکارا","آقا","آقای","آقایان","آمد","آمدن","آمده","آمرانه","آن","آن گاه","آنان","آنانی","آنجا","آنرا","آنطور","آنقدر","آنها","آنهاست","آنچنان","آنچنان که","آنچه","آنکه","آنگاه","آن‌ها","آهان","آهای","آور","آورد","آوردن","آورده","آوه","آی","آیا","آید","آیند","ا","اتفاقا","اثرِ","اجراست","احتراما","احتمالا","احیاناً","اخیر","اخیراً","اری","از","از آن پس","از جمله","ازاین رو","ازجمله","ازش","اساسا","اساساً","است","استفاد","استفاده","اسلامی اند","اش","اشتباها","اشکارا","اصلا","اصلاً","اصولا","اصولاً","اعلام","اغلب","افزود","افسوس","اقل","اقلیت","الا","الان","البته","البتّه","الهی","الی","ام","اما","امروز","امروزه","امسال","امشب","امور","امیدوارم","امیدوارند","امیدواریم","ان","ان شاأالله","انتها","انجام","اند","اندکی","انشاالله","انصافا","انطور","انقدر","انها","انچنان","انکه","انگار","او","اوست","اول","اولا","اولاً","اولین","اون","اکثر","اکثرا","اکثراً","اکثریت","اکنون","اگر","اگر چه","اگرچه","اگه","ای","ایا","اید","ایشان","ایم","این","این جوری","این قدر","این گونه","اینان","اینجا","اینجاست","ایند","اینطور","اینقدر","اینها","اینهاست","اینو","اینچنین","اینک","اینکه","اینگونه","ب ","با","بااین حال","بااین وجود","باد","بار","بارة","باره","بارها","باز","باز هم","بازهم","بازی کنان","بازیگوشانه","باش","باشد","باشم","باشند","باشی","باشید","باشیم","بالا","بالاخره","بالاخص","بالاست","بالای","بالایِ","بالطبع","بالعکس","باوجودی که","باورند","باید","بتدریج","بتوان","بتواند","بتوانی","بتوانیم","بجز","بخش","بخشه","بخشی","بخصوص","بخواه","بخواهد","بخواهم","بخواهند","بخواهی","بخواهید","بخواهیم","بخوبی","بد","بدان","بدانجا","بدانها","بدهید","بدون","بدین","بدین ترتیب","بدینجا","بر","برآنند","برا","برابر","برابرِ","براحتی","براساس","براستی","برای","برایت","برایش","برایشان","برایم","برایمان","برایِ","برخوردار","برخوردارند","برخی","برداری","برعکس","برنامه سازهاست","بروز","بروشنی","بزرگ","بزودی","بس","بسا","بسادگی","بسختی","بسوی","بسی","بسیار","بسیاری","بشدت","بطور","بطوری که","بعد","بعد از این که","بعدا]